---
kind: property
id: P:Autodesk.Revit.DB.ReferencePoint.ShowNormalReferencePlaneOnly
source: html/8a713d3d-c2ac-3b64-3cf9-574a08bcbb64.htm
---
# Autodesk.Revit.DB.ReferencePoint.ShowNormalReferencePlaneOnly Property

Whether all three coordinate planes are shown, or only the
normal (XY) plane.

## Syntax (C#)
```csharp
public bool ShowNormalReferencePlaneOnly { get; set; }
```